[
  {
    "id": "7548299449568805645",
    "author": "notimemcgee",
    "handle": "notimemcgee",
    "text": "I’m confused, if Mumdani won the primary then why is Cuomo still running, aren’t they both dems?",
    "likes": "4",
    "time": 1757475454
  },
  {
    "id": "7548499066604798751",
    "author": "sabitrieharlall",
    "handle": "sabitrieharlall",
    "text": "Oh hell no not Cuomo Mamdani for mayor",
    "likes": "0",
    "time": 1757521941
  },
  {
    "id": "7548294118934381367",
    "author": "WhyJustWhy",
    "handle": "ecodogon",
    "text": "yeah but mamdani is a turnout machine like for the primary he was down by double digits against Cuomo and he managed to flip it by historic new York turnout",
    "likes": "5",
    "time": 1757474191
  },
  {
    "id": "7548270558191682335",
    "author": "💙hazelidbandit21 💙🧿",
    "handle": "girl_run_lifts_fit",
    "text": "oh hell no Mamdani is going to be Mayor",
    "likes": "18",
    "time": 1757468711
  },
  {
    "id": "7548278868021920567",
    "author": "Jay Harvey",
    "handle": "jayharvey07",
    "text": "This will be a turnout election. Mamdani will clean Cuomo’s clock.",
    "likes": "13",
    "time": 1757470642
  },
  {
    "id": "7548529227432444703",
    "author": "Mjolk8",
    "handle": "mjolk8",
    "text": "He’s not surging if you gotta eliminate 2 people who have said they won’t drop out lol",
    "likes": "1",
    "time": 1757528941
  },
  {
    "id": "7548298527827739422",
    "author": "cindygeiger138",
    "handle": "cindygeiger138",
    "text": "hes corrupt",
    "likes": "2",
    "time": 1757475225
  },
  {
    "id": "7548275465044837150",
    "author": "user9204067579931",
    "handle": "user9204067579931",
    "text": "please no",
    "likes": "0",
    "time": 1757469849
  },
  {
    "id": "7548486067877708558",
    "author": "Some_Guy",
    "handle": "someguy1234567",
    "text": "Adams and Sliwa stated they are not dropping out. Adams believes he can make a comeback and win the election similar to like how Zohran was down by 40 points behind Cuomo in the primary and beat Cuomo by 12 points. Adams believes that can happen for him but if they did drop out and they endorsed Cuomo their names will still be on the ballot, so there will be people who are unaware of the candidates dropping who will vote for them. The 3rd independent candidate Jim dropped out of the race but his name will still be on the ballot cuz he did it too late to get his name off the ballot. Trump's involvement in this race is a wild card, so anything can happen",
    "likes": "0",
    "time": 1757518920
  },
  {
    "id": "7548297264444441357",
    "author": "Trinity1725 🇺🇸/🇵🇷🫶",
    "handle": "sanjy1725",
    "text": "Adam’s already said he’s not bowing out and that polling is Bull💩💩 Cuomo isn’t close to winning at all",
    "likes": "1",
    "time": 1757474929
  },
  {
    "id": "7548278449170776845",
    "author": "Boston Born",
    "handle": "boston.born4",
    "text": "not going to happen these polls don't take into account the young black n brown votes. the people the pollsters never talk to are going to show up. the ppl who are barely surviving in nyc... they had a millionaire landlord meeting today to figure out how to back Cuomo.. regular people were pissed about it. because they know Cuomo is going to be bought by the millionaire n billionaire landlord",
    "likes": "0",
    "time": 1757470557
  },
  {
    "id": "7548593139213648654",
    "author": "ramonb671",
    "handle": "ramonb671",
    "text": "Charlie Kirk favored the Republican party and didn't want Mamdani in NYC office...I say vote Republican and honor an assassinated young man......smh....RIP CHARLIE....VOTE Curtis Sliwa",
    "likes": "0",
    "time": 1757543818
  }
]